spring-boot-soap/src/main/resources/get-list-with-higher-counter-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://www.xmlToJavaObjects.com">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getListWithHigherCounterRequest>
            <us:counter>0</us:counter>
        </us:getListWithHigherCounterRequest>
    </soapenv:Body>
</soapenv:Envelope>